    #1)  შექმენით 2 ცვლადი number1 და number2 , ამ ცვლადებში შეინახეთ შესაბამისი მნიშვნელობები და ამ ორი ცვლადის გამოყენებით გააკეთეთ მათემატიკური ოპერაციები, დღევანდელ გკვეთილზე ნასწავლი მათემატიკური ოპერატორებით.

number1= 10

number2= 15

print(number1 + number2)




     #2)  შექმენით ორი ცვლადი birth_year(დაბადების წელი) და current_year(ახლანდელი წელი) შიგნით შეინახე შესაბამისი მნიშვნლობები შენი დაბადების წელი და ახლანდელი წელი, შემდეგ შექმნი მე3 ცვლადი age-სადაც გამოითვლი შენს ასაკს , ზემოთხსენებული ცვლადბის დახმარებით 


birth_year= 2010

current_year= 2026

age= 15

print(birth_year)

print(current_year)

print(age)



      #3)  შექმენი 5 ცვლადი , number1 number2 ...number5 შეინახე შიგნით შესაბამისი მნიშვნელობები და გამოითვალე მათი საშუალო არითმეტიკული ,საბოლოო, მიღებული შედეგი გამოიტანეთ ტერმინალში (საშუალო არითმეტიკული => მონაცემების ჯამი გაყოფილი მონაცემების რაოდენობაზე).


number3= 1
number4= 2
number5= 3
number6= 4
number7= 5

print(number3+number4+number5+number6+number7 / 5)


    #4)კომენტარების გამოყენებით, თქვენი სიტყვებით ახსენით რას ნიშნავს დეკლარაცია , ინიციალიზება  და რეინიციალიზება , ასევე მოიყვანეთ მაგალითები





#Declaration არის - როცა ეუბნები პროგრამას რომ ასეტი ცვლადი არსებობს 

             #მაგალითად
X= 5



#Initialization არის - როცა ცვლადს მნიშვნელს აძლევ

             #მაგალითდ 

age=15



#Reinitialization არის - როცა ცვლადს მნიშვნელს უცვლი 

              #მაგალითდ

score=10   #ძველი

score=20   #ახალი 



#კომენტარების გამოყენებით ახსენით თქვენი სიტყვებით რას ნიშნავს კონკატენაცია(concatenation)

#concatenation არის როცა ვაერთებთ სტრინგებს ერთმანეთში



#6)აუცილებლად უყურეთ ჩანაწერს ხელმეორედ ,ყურადღებით
   
   #Done


          #7)ახსენით თქვენი სიტყვებით რას ნიშნავს debugging


#debugging არის როცა კოდში რაიმე შეცდომას ასწორებ 

