
   #ამდენი მონაცემთა ტიპი საჭირო არის იმის გამო რომ :
   # 1 რადგან კომპიუტერმა იცოდეს რა ტიპის ინფორმაციაა ანუ ტექსტია, ათწილადი თუ რიხვი
   # 2 ოპერაციების სწორად შესასრულებლად 
   # 3 მეხსიერების სწორად გამოსაყენებლად 
   # 4 და შეცდომების ასაცილებლად 

#input ის მაგალით რეალურ ცხოვრებაში არის როცა მაგალითდ pin კოდი სჰეგვყავს ბანკომატში

#output ის მაგალითა როცა ბანკომატი გაძლევს ფულს 


name = "sandro"
age = 15
height = 1.80

print(type(name))
print(type(age))
print(type(height))


km = float(input("შეიყვანე კმ მანძილი: "))
meters = km * 1000

print("მეტრებში ეს მანძილი არის: ", meters)


num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))

print("მიმატება:", num1 + num2)
print("გამოკლება:", num1 - num2)
print("გამრავლება:", num1 * num2)
print("გაყოფა:", num1 / num2)


weight = float(input("შეიყვანე შენი წონა: "))
height = float(input("შეიყვანე შენი სიმაღლე: "))

bmi = weight / (height * height)

print("შენი BMI არის:", bmi)