# იტერეცია არის რაიმეს გამეორება მაგალითდ:

for i in range (10):
  print("მაგალითი")

# ალგორითმი არის ნაბიჯ ნაბიჯ ინსტრუკცია რომ პროგრამა რაიმე მოქმედება ქნას 

# რეალური მაგალითები 

# ჩაის მომზადება
# წყლის ადუღება
# ჩაის ჩაყრა
# დალევა

# გზის პოვნა (Google Maps)
# მისამართის შეყვანა
# საუკეთესო გზის არჩევა
# მოძრაობა მიმართულებით

# სკოლის დავალების გაკეთება
# დავალების წაკითხვა
# ამოხსნა
# გადამოწმება

# ტექსტურად (უბრალოდ სიტყვებით)
# ფსევდოკოდით (ნახევრად კოდური ფორმა)
# დიაგრამით (Flowchart)
# პროგრამირების ენით (Python,და ასშ)

for i in range(25):
    print("for loop")

for i in range(25, 76):
    print(i)

for i in range(40, 91):
    print(i)

for i in range(25, 151, 4):
    print(i)

for i in range(100, 1001, 10):
    print(i)

for i in range(1, 101):
    print(i, "პითონი მაგარია")